[
  { "name": "Pineapple", "description": "A tropical fruit with spiky skin and sweet, tangy yellow flesh, often used in desserts and juices." },
  { "name": "Truck", "description": "A large motor vehicle designed to transport goods or heavy loads over long distances." },
  { "name": "Sphere", "description": "A perfectly round 3D shape where every point on the surface is equidistant from the center." },
  { "name": "Square", "description": "A flat shape with four equal sides and four right angles, often used in geometry and design." },
  { "name": "Beagle", "description": "A small, friendly dog breed known for its strong sense of smell and energetic personality." },
  { "name": "Helicopter", "description": "An aircraft that flies using rotating blades, capable of vertical takeoff and hovering in one spot." },
  { "name": "Police Car", "description": "A vehicle used by law enforcement officers for patrolling and responding to emergencies." },
  { "name": "Watermelon", "description": "A large, juicy fruit with green rind and red flesh filled with black seeds, popular in summer." },
  { "name": "Kiwi", "description": "A small, brown, fuzzy fruit with bright green flesh and tiny black seeds, rich in vitamin C." },
  { "name": "Tank", "description": "A heavily armored military vehicle equipped with large guns, used in combat operations." },
  { "name": "Pear", "description": "A sweet fruit with a bell-like shape and smooth, green or yellow skin." },
  { "name": "Circle", "description": "A 2D shape where all points are equally distant from a central point." },
  { "name": "Diamond", "description": "A geometric shape with four equal sides set at an angle, resembling a tilted square." },
  { "name": "Train", "description": "A series of connected vehicles that run along rails, used for transporting people or goods." },
  { "name": "Lime", "description": "A small green citrus fruit known for its sour taste and refreshing aroma." },
  { "name": "Heart", "description": "A symbol representing love, compassion, and emotion, often drawn with two curves meeting at a point." },
  { "name": "Cow", "description": "A large domesticated animal raised for milk, meat, and leather." },
  { "name": "Pig", "description": "A farm animal known for its intelligence, pinkish skin, and use in producing pork products." },
  { "name": "Alligator", "description": "A large reptile with a powerful jaw and thick skin, found in freshwater habitats." },
  { "name": "Snake", "description": "A legless reptile with a long, slender body that moves by slithering." },
  { "name": "Star", "description": "A five-pointed shape often used to symbolize excellence, light, or fame." },
  { "name": "Capuchin", "description": "A small, intelligent monkey species known for its expressive face and curiosity." },
  { "name": "Lemon", "description": "A bright yellow citrus fruit with a tangy, acidic taste, rich in vitamin C." },
  { "name": "Unicycle", "description": "A single-wheeled cycle often used in circuses and balance training." },
  { "name": "Hot Air Balloon", "description": "A large balloon filled with heated air that carries passengers in a basket through the sky." },
  { "name": "Passion Fruit", "description": "A tropical fruit with a tough rind and sweet-tart pulp filled with edible seeds." },
  { "name": "Banana", "description": "A long, curved yellow fruit that is soft and sweet inside, rich in potassium." },
  { "name": "Rooster", "description": "A male chicken known for its colorful feathers and early morning crowing." },
  { "name": "Plum", "description": "A small, juicy fruit with smooth skin and a single pit in the center." },
  { "name": "Hexagon", "description": "A polygon with six equal sides and six angles, often seen in honeycombs." },
  { "name": "Pomegranate", "description": "A round fruit filled with juicy red seeds, rich in antioxidants and nutrients." },
  { "name": "Triangle", "description": "A shape with three sides and three angles, one of the basic geometric forms." },
  { "name": "Motorcycle", "description": "A two-wheeled motor vehicle designed for fast travel and maneuverability." },
  { "name": "Apple Green", "description": "A variety of apple with crisp, tart green skin and juicy flesh." },
  { "name": "Strawberries", "description": "Small red fruits with a sweet flavor and tiny seeds on their surface." },
  { "name": "Apple", "description": "A popular fruit with smooth skin and crisp, juicy flesh, available in red, green, and yellow varieties." },
  { "name": "Orange", "description": "A round citrus fruit known for its bright color, sweet flavor, and vitamin C content." },
  { "name": "Mango", "description": "A sweet, tropical fruit with smooth skin and juicy orange flesh surrounding a large seed." },
  { "name": "Papaya", "description": "A tropical fruit with orange flesh, black seeds, and a mildly sweet flavor." },
  { "name": "Rectangle", "description": "A four-sided shape with opposite sides equal and all angles at 90 degrees." },
  { "name": "Avocado", "description": "A creamy green fruit rich in healthy fats, often used in salads and spreads." },
  { "name": "Tangerine", "description": "A small orange citrus fruit that is easy to peel and sweet in flavor." },
  { "name": "Cube", "description": "A three-dimensional shape with six equal square faces, like a dice." },
  { "name": "Goat", "description": "A farm animal with horns and a beard, known for producing milk and being a good climber." },
  { "name": "Tiger", "description": "A large striped wild cat known for its strength, speed, and predatory skills." },
  { "name": "Bicycle", "description": "A two-wheeled human-powered vehicle propelled by pedaling." },
  { "name": "Ambulance", "description": "A medical emergency vehicle equipped to transport patients to hospitals." },
  { "name": "Boat", "description": "A watercraft designed to float and move across lakes, rivers, or oceans." },
  { "name": "Tomato", "description": "A red, juicy fruit often used in salads and sauces, botanically a fruit but treated as a vegetable." },
  { "name": "Coconut", "description": "A large tropical fruit with a hard shell, fibrous husk, and edible white flesh." },
  { "name": "Airplane", "description": "A powered flying vehicle with fixed wings and engines that enable flight." },
  { "name": "Pentagon Shape", "description": "A five-sided polygon often used in design and architecture." },
  { "name": "Blueberries", "description": "Small, round blue fruits that are sweet, nutritious, and packed with antioxidants." },
  { "name": "Horse", "description": "A strong, fast mammal domesticated for riding, racing, and farm work." },
  { "name": "Cone Shape", "description": "A 3D geometric shape with a circular base that tapers to a single point." },
  { "name": "Cat", "description": "A small domesticated feline known for its agility, curiosity, and playful nature." },
  { "name": "Peach", "description": "A soft, fuzzy fruit with juicy yellow or pink flesh and a large pit." },
  { "name": "Bus", "description": "A large motor vehicle designed to carry multiple passengers along fixed routes." },
  { "name": "Jeep", "description": "A rugged, four-wheel-drive vehicle designed for off-road and outdoor travel." },
  { "name": "Rabbit", "description": "A small, furry animal with long ears and strong hind legs, known for hopping and burrowing." },
  { "name": "Cherry", "description": "A small red fruit with a sweet or tart flavor and a single seed inside." },
  { "name": "Cylinder", "description": "A 3D shape with two parallel circular bases connected by a curved surface." },
  { "name": "Pyramid", "description": "A solid shape with a polygon base and triangular sides that meet at a point." }
]
